docs/index.org
#+TITLE:     Compendium principles
#+OPTIONS:   toc:nil

* Literate Programming

*Literate programming* (LP) offers 2 classical operations:

- Tangle ::
     Extract the source code blocks and *generate real working code* files for
     further compilation or execution, eventually outside of Emacs.

- Weave ::
     *Export* the whole Org file as literate, *human-readable documentation*
     (generally in HTML or LaTeX).

* Reproducible Research
  :PROPERTIES:
  :ID:       1663ff41-af51-4b07-abc8-6bfed9395b2b
  :END:

Above those, Org Babel adds /in situ/ code evaluation:

- during *interactive* use (in the Org buffer itself),
- during *tangle*, and/or
- during *weave* (code blocks with ~:exports~ set to ~results~ or ~both~)

This allows you to insert in your Org document:

- all *data* (that can reasonably be included),
- all *code* you used, and
- the full set of *outputs* you got,

following the principles of *reproducible research* (RR).
